## Basics data frame

In [1]:
import pandas as pd
# load data - change the path to match your drive!
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86741 entries, 0 to 86740
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86741 non-null  object
 1   titleType       86741 non-null  object
 2   primaryTitle    86741 non-null  object
 3   originalTitle   86741 non-null  object
 4   isAdult         86741 non-null  int64
 5   startYear       86741 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86741 non-null  int64
 8   genres          86741 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

### Removing unwanted columns from Basics

In [2]:
basics = basics.drop(columns=['titleType', 'originalTitle','isAdult','endYear'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86741 entries, 0 to 86740
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86741 non-null  object
 1   primaryTitle    86741 non-null  object
 2   startYear       86741 non-null  float64
 3   runtimeMinutes  86741 non-null  int64
 4   genres          86741 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.3+ MB

### Genres separation and creating columns

In [3]:
## adding expand=True
basics['genres_split'] = basics['genres'].str.split(',')

In [4]:
## exploding the column of lists
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
86739,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
86739,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
86739,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
86740,tt9916362,Coven,2020.0,92,"Drama,History",Drama
86740,tt9916362,Coven,2020.0,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
basics = basics.drop(columns ='genres_split')
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

### Create a new title_genres table

In [7]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### Create a genres table

In [8]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
## Manually make dataframe with named cols from .keyd and .values
genres = pd.DataFrame({'Genre_ID':genre_map.values(),
                       'Genre_name': genre_map.keys()})
genres.head()

   Genre_ID Genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [10]:
## save data for next lesson
basics.to_csv('Title Basics.csv', index=False)

### Ratings Dataframe

In [11]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499498 entries, 0 to 499497
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         499498 non-null  object
 1   averageRating  499498 non-null  float64
 2   numVotes       499498 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

In [12]:
## save data for next lesson
ratings.to_csv('Title Ratings.csv', index=False)

### TMDB_API Dataframe

In [13]:
tmdb_api = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_api.head()
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2569 entries, 0 to 2568
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2569 non-null   object
 1   adult                  2568 non-null   float64
 2   backdrop_path          1400 non-null   object
 3   belongs_to_collection  205 non-null    object
 4   budget                 2568 non-null   float64
 5   genres                 2568 non-null   object
 6   homepage               172 non-null    object
 7   id                     2568 non-null   float64
 8   original_language      2568 non-null   object
 9   original_title         2568 non-null   object
 10  overview               2518 non-null   object
 11  popularity             2568 non-null   float64
 12  poster_path            2310 non-null   object
 13  production_companies   2568 non-null   object
 14  production_countries   2568 non-null   object
 15  release_date           2549 non-null   object
 16  revenue                2568 non-null   float64
 17  runtime                2568 non-null   float64
 18  spoken_languages       2568 non-null   object
 19  status                 2568 non-null   object
 20  tagline                1103 non-null   object
 21  title                  2568 non-null   object
 22  video                  2568 non-null   float64
 23  vote_average           2568 non-null   float64
 24  vote_count             2568 non-null   float64
 25  certification          816 non-null    object
dtypes: float64(9), object(17)
memory usage: 522.0+ KB

### Removing unwanted columns from Ratings

In [14]:
tmdb_api = tmdb_api.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection', 'genres','homepage', 'id',
                                  'original_language', 'original_title', 'overview','popularity','poster_path',
                                  'production_companies', 'production_countries','release_date','runtime','spoken_languages',
                                  'status','tagline','title','video','vote_average','vote_count'])
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2569 entries, 0 to 2568
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2569 non-null   object
 1   budget         2568 non-null   float64
 2   revenue        2568 non-null   float64
 3   certification  816 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.4+ KB

In [15]:
tmdb_api.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

In [16]:
# remove ids that are 0
tmdb_api = tmdb_api.loc[ tmdb_api['imdb_id']!='0']
tmdb_api

        imdb_id      budget     revenue certification
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  12854953.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2564  tt7797670         0.0         0.0           NaN
2565  tt7797790         0.0         0.0           NaN
2566  tt8665056         0.0         0.0           NaN
2567  tt8795764         0.0         0.0            NR
2568  tt9071078         0.0         0.0           NaN

[2568 rows x 4 columns]

In [17]:
tmdb_api = tmdb_api.reset_index(drop=True)
tmdb_api

        imdb_id      budget     revenue certification
0     tt0113026  10000000.0         0.0           NaN
1     tt0113092         0.0         0.0           NaN
2     tt0116391         0.0         0.0           NaN
3     tt0118694    150000.0  12854953.0            PG
4     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2563  tt7797670         0.0         0.0           NaN
2564  tt7797790         0.0         0.0           NaN
2565  tt8665056         0.0         0.0           NaN
2566  tt8795764         0.0         0.0            NR
2567  tt9071078         0.0         0.0           NaN

[2568 rows x 4 columns]

In [18]:
## save data for next lesson
tmdb_api.to_csv('TMDB API Results.csv', index=False)

## SQL

In [19]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote
# Create connection string using credentials following this format

In [20]:
import json
with open('/Users/miran/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [21]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movie"

In [22]:
# create sqlite engine for a database called schools
engine = create_engine(connection)
# create connection to engine
conn = engine.connect()

In [23]:
database_exists(connection)

True

In [24]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [25]:
from sqlalchemy.types import *

# Calculate max string lengths for object columns

key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
genre_name_len = genres['Genre_name'].fillna('').map(len).max()
certification_len = tmdb_api['certification'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects

basics_schema = {
    "tconst": String(key_len+1), "primaryTitle": Text(title_len+1),
    'startYear': Float(), 'endYear': Float(),
    'runtimeMinutes': Integer(), 'averageRating': Float(),
    'numVotes': Integer(),'Genre_ID': Integer(),'Genre_Name': Text(genre_name_len+1),
    'imdb_id': String(key_len+1), 'revenue': Float(), 'budget': Float(), 
    'certification': Text(certification_len+1)}

In [26]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

86741

In [27]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=basics_schema,if_exists='replace',index=False)

26

In [28]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=basics_schema,if_exists='replace',index=False)

162033

In [29]:
# Save to sql with dtype and index=False
tmdb_api.to_sql('tmdb_data',engine,dtype=basics_schema,if_exists='replace',index=False)

2568

In [30]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=basics_schema,if_exists='replace',index=False)

499498

In [31]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [32]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_movie
0          genres
1    title_basics
2    title_genres
3   title_ratings
4       tmdb_data